app/controllers/login_controller.rb

	def create
    team = Team.where(teamname: params[:teamname]).first
---
SELECT  "teams".* FROM "teams" WHERE "teams"."teamname" = $1  ORDER BY "teams"."id" ASC LIMIT 1  [["teamname", "uvfhiugh"]]