app/controllers/registration_controller.rb

INSERT INTO "teams" ("teamname", "password_digest", "teamcolor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "players" ("prename", "surname", "age", "email", "phone", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["prename", "j"], ["surname", "j"], ["age", 0], ["email", "j"], ["phone", 0], ["team_id", 4], ["created_at", "2015-02-20 14:50:34.425465"], ["updated_at", "2015-02-20 14:50:34.425465"]]
---
	def create
		@team = Team.new(team_params)

			if @team.save
				@player1 = @team.players.build(players_params[0].permit(:prename, :surname, :age, :email, :phone))
				@player2 = @team.players.build(players_params[1].permit(:prename, :surname, :age, :email, :phone))


				if @player1.save && @player2.save