app/controllers/teams_controller.rb

INSERT INTO "teams" ("teamname", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["teamname", "Firstteam"], ["created_at", "2015-02-19 14:42:09.238435"], ["updated_at", "2015-02-19 14:42:09.238435"]]
INSERT INTO "players" ("prename", "surname", "age", "email", "phone", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["prename", "m"], ["surname", "m"], ["age", 0], ["email", "m"], ["phone", 0], ["team_id", 7], ["created_at", "2015-02-19 15:41:43.146802"], ["updated_at", "2015-02-19 15:41:43.146802"]]
---
	def create
		Rails.logger.debug("HELELEOIEHOUHEIU")
		Rails.logger.debug(team_params)
		@team = Team.new(team_params)
			if @team.save
				Rails.logger.debug(players_params)
				player_params1 = players_params[0].permit(:prename, :surname, :age, :email, :phone)
				player_params2 = players_params[1].permit(:prename, :surname, :age, :email, :phone)

				@player1 = @team.players.new(player_params1)
				@player2 = @team.players.new(player_params2)
				if @player1.save && @player2.save