app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 3]]
---
	def edit
		@team = Team.find(session[:current_team_id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "players" SET "prename" = $1, "surname" = $2, "age" = $3, "email" = $4, "phone" = $5, "updated_at" = $6 WHERE "players"."id" = $7  [["prename", "Domingo"], ["surname", "Spain"], ["age", 24], ["email", "domingo@domingo.net"], ["phone", 20], ["updated_at", "2015-02-23 08:32:19.097485"], ["id", 5]]
---
	def update
		@team = Team.find(session[:current_team_id])
	    @team.update(team_params)
	    @team.players[0].update(players_params[0].permit(:prename, :surname, :age, :email, :phone))