app/controllers/welcome_controller.rb

SELECT  "teams".* FROM "teams"  ORDER BY "teams"."id" ASC LIMIT 1
SELECT  "positions".* FROM "positions" WHERE "positions"."team_id" = $1  ORDER BY "positions"."id" DESC LIMIT 1  [["team_id", 1]]
---
	def liveblog
		@teams = Team.all
		teamlist = []
		Team.all.each do |t|
			if t.positions.last.distance != nil

SELECT "teams".* FROM "teams"
---
	def data
		@teams = Team.all

SELECT  "teams".* FROM "teams"  ORDER BY "teams"."id" ASC LIMIT 1
SELECT "positions".* FROM "positions" WHERE "positions"."team_id" = $1  [["team_id", 1]]
---
	def map
		@positions = Team.first.positions